{
  "architectures": [
    "EfficientNetForImageClassification"
  ],
  "batch_norm_eps": 0.001,
  "batch_norm_momentum": 0.99,
  "depth_coefficient": 1.0,
  "depth_divisor": 8,
  "depthwise_padding": [],
  "drop_connect_rate": 0.2,
  "dropout_rate": 0.2,
  "dtype": "float32",
  "expand_ratios": [
    1,
    6,
    6,
    6,
    6,
    6,
    6
  ],
  "hidden_act": "swish",
  "hidden_dim": 1280,
  "id2label": {
    "0": "logo",
    "1": "photograph",
    "10": "signature",
    "11": "screenshot_from_manual",
    "12": "geographical_map",
    "13": "pie_chart",
    "14": "page_thumbnail",
    "15": "stamp",
    "16": "music",
    "17": "calendar",
    "18": "qr_code",
    "19": "bar_code",
    "2": "icon",
    "20": "full_page_image",
    "21": "scatter_plot",
    "22": "chemistry_structure",
    "23": "topographical_map",
    "24": "crossword_puzzle",
    "25": "box_plot",
    "3": "engineering_drawing",
    "4": "line_chart",
    "5": "bar_chart",
    "6": "other",
    "7": "table",
    "8": "flow_chart",
    "9": "screenshot_from_computer"
  },
  "image_size": 224,
  "in_channels": [
    32,
    16,
    24,
    40,
    80,
    112,
    192
  ],
  "initializer_range": 0.02,
  "kernel_sizes": [
    3,
    3,
    5,
    3,
    5,
    5,
    3
  ],
  "label2id": {
    "bar_chart": "5",
    "bar_code": "19",
    "box_plot": "25",
    "calendar": "17",
    "chemistry_structure": "22",
    "crossword_puzzle": "24",
    "engineering_drawing": "3",
    "flow_chart": "8",
    "full_page_image": "20",
    "geographical_map": "12",
    "icon": "2",
    "line_chart": "4",
    "logo": "0",
    "music": "16",
    "other": "6",
    "page_thumbnail": "14",
    "photograph": "1",
    "pie_chart": "13",
    "qr_code": "18",
    "scatter_plot": "21",
    "screenshot_from_computer": "9",
    "screenshot_from_manual": "11",
    "signature": "10",
    "stamp": "15",
    "table": "7",
    "topographical_map": "23"
  },
  "model_type": "efficientnet",
  "num_block_repeats": [
    1,
    2,
    2,
    3,
    3,
    4,
    1
  ],
  "num_channels": 3,
  "num_hidden_layers": 64,
  "out_channels": [
    16,
    24,
    40,
    80,
    112,
    192,
    320
  ],
  "out_features": null,
  "pooling_type": "mean",
  "squeeze_expansion_ratio": 0.25,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7"
  ],
  "strides": [
    1,
    2,
    2,
    2,
    1,
    2,
    1
  ],
  "transformers_version": "4.57.3",
  "width_coefficient": 1.0
}
